Revit 2026 API

# RebarCrankTypeUtilsGetAllRebarCrankTypes Method

---

Gets all the Rebar Crank Types elements from the document.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ElementId> GetAllRebarCrankTypes(
	Document document
)
```
```vb
Public Shared Function GetAllRebarCrankTypes (
	document As Document
) As IList(Of ElementId)
```
```cpp
public:
static IList<ElementId^>^ GetAllRebarCrankTypes(
	Document^ document
)
```
```fsharp
static member GetAllRebarCrankTypes :
        document : Document -> IList<ElementId>
```

#### Parameters

document Document
     The document.

#### Return Value

IListElementId Returns all the Rebar Crank Types elements from the document.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Internally this function is returning all element ids from a FilteredElementCollector of category BuiltInCategory.OST_RebarCrankType.

#### Reference

RebarCrankTypeUtils Class

Autodesk.Revit.DB.Structure Namespace